public class Main {
    public static void main(String[] args) {
//        Все люди изначально стараются писать чистый код.
//        Вряд ли найдётся программист, который намеренно плодит грязный код во вред проекту.
//        Но тогда почему чистый код становится грязным?
//        Впервые метафору «технического долга», относительно грязного кода, предложил Говард Каннингэм.
//        Взяв кредит в банке, вы сможете ускорить какое-то приобретение.
//        Однако вернуть вам предстоит не только основную сумму кредита,
//        но и дополнительные проценты, которые набегут за то время, пока вы не погасите заём.
//        Также, вы можете взять несколько кредитов одновременно.
//        Более того - вы можете набрать столько кредитов,
//        что сумма процентов перевесит ваш совокупный доход и сделает полное погашение невозможным.
//        То же происходит и с кодом. Сегодня вы временно ускоритесь, не написав тесты для новой фичи.
//        Но каждый день пока эту фичу приходится тестировать руками, замедляет ваш общий прогресс.
//        В какой-то момент, сумма этого времени превысит ту, которую вы бы потратили на изначальное написание теста.
    }
}
