public class Main {
    public static void main(String[] args) {
//        Код должен стать чище.
//        Если после рефакторинга код остался таким же грязным...
//        Что ж, сожалею, вы только что потратили зря час своей жизни. Но обязательно разберитесь почему это произошло.
//        Зачастую это случается тогда, когда вы отходите от рефакторинга мелкими изменениями
//        и смешиваете кучу рефакторингов в одно большое изменение.
//        Так очень легко потерять голову и наломать дров, особенно, если вы ограничены во времени.
//        Но такое случается и при работе с особенно запущенным кодом.
//        Что бы вы ни улучшили, код в целом всё равно остаётся уродливым.
//        В этом случае улучшить код можно лишь полностью переписав некоторые его части.
//        Но помните, что перед этим у вас должны быть написаны тесты, а также запланирован изрядный кусок времени.

    }
}
